app/controllers/eventos_controller.rb

SELECT "eventos".* FROM "eventos"
---
  def index
    @eventos = Evento.all.sort_by(&:id).reverse

INSERT INTO "eventos" ("created_at", "descripcion", "fecha", "titulo", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @evento = Evento.new(evento_params)

    respond_to do |format|
      if @evento.save

UPDATE "eventos" SET "descripcion" = ?, "updated_at" = ? WHERE "eventos"."id" = 1  [["descripcion", "<p>km<strong>dsklmskmdcksmcksmdclksmdckmsdckmsdckms</strong>dlkcmsdc</p>"], ["updated_at", Wed, 11 Sep 2013 19:36:06 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @evento.update(evento_params)

SELECT "eventos".* FROM "eventos" WHERE "eventos"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_evento
      @evento = Evento.find(params[:id])