app/controllers/newsletters_controller.rb

  def index
    @newsletters = Newsletter.all.sort_by(&:id).reverse
---
SELECT "newsletters".* FROM "newsletters"

  def create
    @newsletter = Newsletter.new(newsletter_params)

    respond_to do |format|
      if @newsletter.save
---
INSERT INTO "newsletters" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "dsjsdjwiwoeijroiwejiowejdiowedjweo"], ["created_at", Wed, 04 Sep 2013 19:30:15 UTC +00:00], ["title", "prueba"], ["updated_at", Wed, 04 Sep 2013 19:30:15 UTC +00:00]]

  def update
    respond_to do |format|
      if @newsletter.update(newsletter_params)
---
UPDATE "newsletters" SET "content" = ?, "updated_at" = ? WHERE "newsletters"."id" = 4

  def destroy
    @newsletter.destroy
---
DELETE FROM "newsletters" WHERE "newsletters"."id" = ?  [["id", 2]]

    def set_newsletter
      @newsletter = Newsletter.find(params[:id])
---
SELECT "newsletters".* FROM "newsletters" WHERE "newsletters"."id" = ? LIMIT 1  [["id", "2"]]