app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "name", "password", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 04 Sep 2013 16:21:29 UTC +00:00], ["name", "admin"], ["password", "admin"], ["updated_at", Wed, 04 Sep 2013 16:21:29 UTC +00:00]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save